report/ycsb/output_0_100.txt
[OVERALL], RunTime(ms), 726
[OVERALL], Throughput(ops/sec), 1377.4104683195592
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 8
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.1019283746556474
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 8
[TOTAL_GC_TIME_%], Time(%), 1.1019283746556474
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 736.0
[CLEANUP], MinLatency(us), 736
[CLEANUP], MaxLatency(us), 736
[CLEANUP], 95thPercentileLatency(us), 736
[CLEANUP], 99thPercentileLatency(us), 736
[UPDATE], Operations, 1000
[UPDATE], AverageLatency(us), 581.329
[UPDATE], MinLatency(us), 298
[UPDATE], MaxLatency(us), 9679
[UPDATE], 95thPercentileLatency(us), 737
[UPDATE], 99thPercentileLatency(us), 3097
[UPDATE], Return=OK, 1000