report/ycsb/output_0_100.txt
/usr/bin/java  -classpath /home/xizhen/tp3/ycsb-0.17.0/conf:/home/xizhen/tp3/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/core-0.17.0.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/xizhen/temp/redis-cluster/workload_0_100 -p redis.host=127.0.0.1 -p redis.port=6379
[OVERALL], RunTime(ms), 1382
[OVERALL], Throughput(ops/sec), 723.589001447178
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 17
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.2301013024602026
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 17
[TOTAL_GC_TIME_%], Time(%), 1.2301013024602026
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 772.0
[CLEANUP], MinLatency(us), 772
[CLEANUP], MaxLatency(us), 772
[CLEANUP], 95thPercentileLatency(us), 772
[CLEANUP], 99thPercentileLatency(us), 772
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 1236.867
[INSERT], MinLatency(us), 509
[INSERT], MaxLatency(us), 13127
[INSERT], 95thPercentileLatency(us), 1898
[INSERT], 99thPercentileLatency(us), 5231
[INSERT], Return=OK, 1000