report/ycsb/output_10_90.txt
/usr/bin/java  -classpath /home/xizhen/tp3/ycsb-0.17.0/conf:/home/xizhen/tp3/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/core-0.17.0.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P workloads/workload_10_90 -p redis.host=127.0.0.1 -p redis.port=6379
[OVERALL], RunTime(ms), 635
[OVERALL], Throughput(ops/sec), 1574.8031496062993
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 7
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.1023622047244095
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 7
[TOTAL_GC_TIME_%], Time(%), 1.1023622047244095
[READ], Operations, 104
[READ], AverageLatency(us), 440.22115384615387
[READ], MinLatency(us), 238
[READ], MaxLatency(us), 7587
[READ], 95thPercentileLatency(us), 512
[READ], 99thPercentileLatency(us), 3817
[READ], Return=OK, 104
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1633.0
[CLEANUP], MinLatency(us), 1633
[CLEANUP], MaxLatency(us), 1633
[CLEANUP], 95thPercentileLatency(us), 1633
[CLEANUP], 99thPercentileLatency(us), 1633
[UPDATE], Operations, 896
[UPDATE], AverageLatency(us), 509.2299107142857
[UPDATE], MinLatency(us), 294
[UPDATE], MaxLatency(us), 21567
[UPDATE], 95thPercentileLatency(us), 692
[UPDATE], 99thPercentileLatency(us), 2657
[UPDATE], Return=OK, 896