report/ycsb/output_10_90.txt
/usr/bin/java  -classpath /home/xizhen/tp3/ycsb-0.17.0/conf:/home/xizhen/tp3/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/core-0.17.0.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/xizhen/temp/redis-cluster/workload_10_90 -p redis.host=127.0.0.1 -p redis.port=6379
[OVERALL], RunTime(ms), 1005
[OVERALL], Throughput(ops/sec), 995.0248756218906
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 17
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.691542288557214
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 17
[TOTAL_GC_TIME_%], Time(%), 1.691542288557214
[READ], Operations, 110
[READ], AverageLatency(us), 797.4545454545455
[READ], MinLatency(us), 210
[READ], MaxLatency(us), 49759
[READ], 95thPercentileLatency(us), 1266
[READ], 99thPercentileLatency(us), 2307
[READ], Return=OK, 110
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3761.0
[CLEANUP], MinLatency(us), 3760
[CLEANUP], MaxLatency(us), 3761
[CLEANUP], 95thPercentileLatency(us), 3761
[CLEANUP], 99thPercentileLatency(us), 3761
[INSERT], Operations, 890
[INSERT], AverageLatency(us), 885.443820224719
[INSERT], MinLatency(us), 526
[INSERT], MaxLatency(us), 25311
[INSERT], 95thPercentileLatency(us), 1640
[INSERT], 99thPercentileLatency(us), 4037
[INSERT], Return=OK, 890