report/ycsb/output_50_50.txt
/usr/bin/java  -classpath /home/xizhen/tp3/ycsb-0.17.0/conf:/home/xizhen/tp3/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/core-0.17.0.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/xizhen/tp3/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/home/xizhen/tp3/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/xizhen/temp/redis-cluster/workload_50_50 -p redis.host=127.0.0.1 -p redis.port=6379
[OVERALL], RunTime(ms), 830
[OVERALL], Throughput(ops/sec), 1204.8192771084337
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 17
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.0481927710843375
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 17
[TOTAL_GC_TIME_%], Time(%), 2.0481927710843375
[READ], Operations, 502
[READ], AverageLatency(us), 355.8764940239044
[READ], MinLatency(us), 167
[READ], MaxLatency(us), 23183
[READ], 95thPercentileLatency(us), 419
[READ], 99thPercentileLatency(us), 2299
[READ], Return=OK, 502
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 841.0
[CLEANUP], MinLatency(us), 841
[CLEANUP], MaxLatency(us), 841
[CLEANUP], 95thPercentileLatency(us), 841
[CLEANUP], 99thPercentileLatency(us), 841
[INSERT], Operations, 498
[INSERT], AverageLatency(us), 1005.7369477911647
[INSERT], MinLatency(us), 463
[INSERT], MaxLatency(us), 15279
[INSERT], 95thPercentileLatency(us), 1852
[INSERT], 99thPercentileLatency(us), 4935
[INSERT], Return=OK, 498